// Импорт функционала ==============================================================================================================================================================================================================================================================================================================================
// import { isMobile } from "./functions.js";
// import { formsModules } from "./forms/forms.js";

ymaps.ready(function () {
	var myMap = new ymaps.Map("YMapsID", {
		center: [41.808599, -88.011389],
		controls: ['zoomControl'],
		zoom: 9,
	});

	// создание маркера
	var myPlacemark = new ymaps.Placemark([41.808599, -88.011389], {
		content: 'название маркера',
		balloonContent: 'html-контент',
	});

	// добавление маркера на карту
	myMap.geoObjects.add(myPlacemark);

});
